tutorials/multiphase/settlingFoam/tank3D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    SYMP3
    {
        type            symmetryPlane;
    }

    INLE1
    {
        type            zeroGradient;
    }

    OUTL9
    {
        type            zeroGradient;
    }

    OUTL10
    {
        type            zeroGradient;
    }

    OUTL11
    {
        type            zeroGradient;
    }

    OUTL12
    {
        type            zeroGradient;
    }

    WALL6
    {
        type            zeroGradient;
    }

    WALL8
    {
        type            zeroGradient;
    }

    WALL61
    {
        type            zeroGradient;
    }

    WALL62
    {
        type            zeroGradient;
    }

    WALL63
    {
        type            zeroGradient;
    }

    WALL64
    {
        type            zeroGradient;
    }

    WALL65
    {
        type            zeroGradient;
    }

    WALL66
    {
        type            zeroGradient;
    }

    WALL67
    {
        type            zeroGradient;
    }

    WALL68
    {
        type            zeroGradient;
    }

    WALL69
    {
        type            zeroGradient;
    }

    WALL7
    {
        type            zeroGradient;
    }

    WALL70
    {
        type            zeroGradient;
    }

    OUTL15
    {
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //
